In [2]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [25]:
index=([1,2,3])
names=(["Dalal","Nada","Sara"])
s=pd.Series(names,index=index)
s

1    Dalal
2     Nada
3     Sara
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [26]:
s=pd.Series(names,index=index)
s.index=([11,12,13])
s

11    Dalal
12     Nada
13     Sara
dtype: object

## Q3: Retrieve First and second elements.

In [27]:
s[:2]

11    Dalal
12     Nada
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [32]:
#Adding
s1=pd.Series({15:"Dalal"})
s1

15    Dalal
dtype: object

In [33]:
#Dublicate
s2= pd.concat((s,s1))
s2

11    Dalal
12     Nada
13     Sara
15    Dalal
dtype: object

In [34]:
#Removing the dublication
s2.drop_duplicates()

11    Dalal
12     Nada
13     Sara
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [3]:
 data = {'ID': [1, 2, 3, 4, 5, 6],
        'Name': ['Dalal', 'Sara', 'Nada', 'Ahmad', 'Reem', 'Hind'],
        'GPA':   [4.5, 2.8, 3.2, 5.0, 3.2, 2.6]}
Students=pd.DataFrame(data,columns=['ID', 'Name', 'GPA'])
Students

   ID   Name  GPA
0   1  Dalal  4.5
1   2   Sara  2.8
2   3   Nada  3.2
3   4  Ahmad  5.0
4   5   Reem  3.2
5   6   Hind  2.6

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [44]:
DataFile = pd.read_csv("educ_figdp_1_Data.csv")
DataFile.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

##### bases on dataframe in Q5

In [45]:
#loc
print(Students.loc[1:3, ['ID', 'Name']])

   ID   Name
1   2   Sara
2   3   Nada
3   4  Ahmad

In [49]:
#slice
print(Students.iloc[1:4, 0:2])

   ID   Name
1   2   Sara
2   3   Nada
3   4  Ahmad